MARKET_CODE_KOSPI = 1
MARKET_CODE_KOSDAQ = 2

CREON_MARKET_CODE_KOSPI = "001"
CREON_MARKET_CODE_KOSDAQ = "201"
CREON_MARKET_CODE_KOSPI200 = "180"

MarketEye = {
    # "대비부호": 2,  # '1': 상한, '2': 상승, '3': 보합, '4': 하한, '5': 하락
    # "전일대비": 3,  # 반드시 대비부호(2)와 같이 요청
    "현재가": 4,
    "시가": 5,
    "고가": 6,
    "저가": 7,
    # "매도호가": 8,
    # "매수호가": 9,
    "거래량": 10,
    "거래대금(원)": 11,
    # "장구분": 12,  # '0': 장전, '1': 동시호가, '2': 장중
    "총상장주식수(천주)": 20,
    "외국인보유비율": 21,
    # "전일거래량": 22,
    # "전일종가": 23,
    # "체결강도": 24,
    # "체결구분": 25,  # '1': 매수체결, '2': 매도체결
    "미결제약정": 27,
    # "19일종가합": 32,
    "상한가": 33,
    "하한가": 34,
    "외국인순매매(주)": 62,
    "52주최고가": 63,
    "52주최저가": 64,
    "연중주최저가": 65,
    "연중최저가": 66,
    "PER": 67,
    "EPS": 70,
    "자본금(백만원)": 71,
    "액면가": 72,
    "배당률": 73,
    "배당수익률": 74,
    "부채비율": 75,
    "유보율": 76,
    "ROE": 77,  # 자기자본순이익률
    "매출액증가율": 78,
    "경상이익증가율": 79,
    "순이익증가율": 80,
    "매출액(백만원)": 86,
    "경상이익(원)": 87,
    "당기순이익(원)": 88,
    "BPS": 89,  # 주당순자산
    "영업이익증가율": 90,
    "영업이익(원)": 91,
    "매출액영업이익률": 92,
    "매출액경상이익률": 93,
    "이자보상비율": 94,
    "결산년월": 95,  # yyyymm
    "분기BPS": 96,
    "분기매출액증가율": 97,
    "분기영업이익증가율": 98,
    "분기경상이익증가율": 99,
    "분기순이익증가율": 100,
    "분기매출액": 101,
    "분기영업이익": 102,
    "분기경상이익(원)": 103,
    "분기당기순이익(원)": 104,
    "분기매출액영업이익률": 105,
    "분기매출액경상이익률": 106,
    "분기ROE": 107,
    "분기이자보상비율": 108,
    "분기유보율": 109,
    "분기부채비율": 110,
    "최근분기년월": 111,  # yyyymm
    "BASIS": 112,
    # "현지날짜": 113,  # yyyymmdd
    # "국가명": 114,  # 해외지수국가명
    # "ELW이론가": 115,
    "프로그램순매수": 116,
    "당일외국인순매수": 118,
    "당일기관순매수": 120,
    # "전일외국인순매수": 121,
    # "전일기관순매수": 122,
    "SPS": 123,
    "CFPS": 124,
    "EBITDA(백만원)": 125,
    "신용잔고율": 126,
    # "공매도수량": 127,
    # "공매도일자": 128,
    "베타계수": 150,
    "당일개인순매수": 156,
    # "전일개인순매수": 157,
    # "5일전종가": 158,
    # "10일전종가": 159,
    # "20일전종가": 160,
    # "60일전종가": 161,
    # "120일전종가": 162,
}
